1974=morrison=george__biography.org
#+title:      George Leonard Morrison, 1885-1974
#+date:       [2026-03-15 Sun 17:33]
#+SUBTITLE: From horse and buggy to the moon landing
#+Author: George Morrison Jones
#+signature:  1974=morrison=george
#+email: gmj@pobox.com
#+filetags:   :biography:public:
#+identifier: 20260315T173357
#+BIBLIOGRAPHY: family.bib
#+cite_export: csl chicago-fullnote-bibliography.csl
#+OPTIONS: author:t date:t 
#+OPTIONS: html-postamble:nil
#+LATEX_COMPILER: pdflatex
#+LATEX_HEADER: \usepackage{pmboxdraw}
#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \preauthor{\begin{center}\large}
#+LATEX_HEADER: \postauthor{\par\normalsize gmj@pobox.com\end{center}}
#+OPTIONS: email:nil
#+latex_class: article
#+latex_class_options: [titlepage]
#+MACRO: conditional-title (eval (if (org-export-derived-backend-p org-export-current-backend 'latex) "#+OPTIONS: title:t" "#+OPTIONS: title:nil"))

#+last_saved: 2026-03-16 13:48



{{{conditional-title}}}

* Intro
  George Leonard Morrison was born in 1885 and died in 1974. His life spanned the age of
  horse and buggy to the moon landing.

  George was born just as the American West was closing. As a young
  man, he went west to work as a cook, following the wheat harvest
  north across the Great Plains, traveled as far away as Idaho with a
  cousin, worked (possibly in the mines) in Hibbing, Minnesota where
  his brother Fred lived, and was scammed in a land deal in Roswell,
  NM. He sang in a barber shop quartet.

  During his life, George saw the invention of the automobile, the
  airplane, the telephone, movies, records, radio, TV, the atomic
  bomb, and rockets that took men to the moon and back.  As someone
  raised with the 19th century idea of "progress" I'm sure it was all
  amazing, but not totally unexpected.

  On the world-events front, he saw WW I, the rise of communism in
  Russia and China, the Depression, WW II, the effective end of the
  British empire, and wars in Korea and Vietnam.

* From Duck Creek to Ross County

 George's father, Elisha Ford Morrison, was veteran of the Union
 army. I still have some of his Grand Army of the Republic (GAR)
 reunion memorabilia and medals. Mike has his rifle. It was picked up
 on the battlefield after his original rifle stopped a bullet that
 would likely have killed him (and this narrative). He was at the
 battle of Vicksburg. We have copies of his diary from the war. He
 married Lydia Catharine (Kate) Gould in 1868.

 The Morrison family moved from Lower Salem/Duck Creek, Ohio (14 miles
 north of Marietta/the Ohio River) to Ross County just after the
 Civil War, 1866 I think. George was the baby of the family of 6
 children. The Morrisons initially lived near the Bowdles (my 2nd
 cousins), on what is now called The Morrison Road. The Bowdle farm was in the
 same family 1800-~2010.

 Ties to "Duck Creek" remained strong for several generations. There
were trips to reunions and family events (Goulds) in Duck Creek/Lower
Salem. George's cousin Charlie Gould, a geologist who discovered much
of the oil in the Southwest, visited his Ross County relatives a time
or two. George and his brother Ernie thought he was stuck up. Charlie
Gould's autobiography /Covered Wagon Geologist/ describes the "post-frontier"
life in the community.

 The community is even mentioned several times in David McCollugh's
book The Pioneers, which documents the founding of the northwest Territory
at Marietta. My five-great grandfather Amos Porter was one
of the early settlers. I still have many family artifacts (family
Bibles, records, furniture, etc.) from Duck Creek. Even in my Youth,
we went to Duck Creek to see the graves at "Mount Ephriam"/"Gould's
Church" and the family barn that was used to hide runaway slaves 14
miles north of the Ohio river. My great-grandmother wrote an extant
letter to the Columbus Dispatch detailing those activities.

* The Farm

My great-grandfather Elisha Morrison bought the farm over the hill
from the Bowdles in 1872. George and the last 4 of his 5 siblings were
born there, as were Mom and Philip. Our family lived on that farm for
almost 100 years. I think the house was originally a small with one story
and was enlarged. I have the receipts (1880s?) for the windows that
were installed when they expanded. I remember Dad washing the outside
of the 2nd story windows on a ladder when George was too old to do
it (and, most likely, when Grandma could not stand to have them dirty).

* Stories from Youth
The original Bowdle cabin was near where the Bowdle/Morrison cemetery
is today (Union Township, Ross County, Ohio). George told of having
seen the cabin in his youth, with slits still
there for shooting out of (Indians...).

As a boy, George attended the one-room school house (the Bowdle School)
where his sister Myrtie[fn:1] Morrison (Bowdle) was his teacher. They
used McGuffey readers and other books, some of which I still have.
In those days, you learned all 88 Ohio counties, their county seats,
their chief agricultural output, etc. One day, the story goes, George thought
he didn't have to mind the teacher because she was his sister, so he
bit her.

In the early 20th century, neighbor Jake Lapp owned a threshing machine (before
combines).  He went around to different farms in turn threshing their
wheat. (Threshing is beating the wheat to remove the stalks and husks and make the seeds fall out.)  I think it was a community event; everyone took turns helping
on each other's farms.   And the women cooked up a storm for the hungry
boys.  Pretty sure I saw echos of that in the way Grandma and Aunt
Bess cooked.

There was apparently an Indian village on the site of the Morrison
farm at some point, in the area down by the creek (Beirs Run) where it
crossed the Allbright-Mill Road.   When plowing was done with horses,
they would often see flint arrow-heads, stone axes etc.  They
collected a box full of 

