1974=morrison=george__biography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-16 Mon 11:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>George Leonard Morrison, 1885-1974</title>
<meta name="author" content="George Morrison Jones" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">George Leonard Morrison, 1885-1974</h1>
          <p class="subtitle">From horse and buggy to the moon landing</p>
          <br>
          <p class="subtitle">George Morrison Jones</p>
          <p class="subtitle"><a href="mailto:gmj@pobox.com">gmj@pobox.com</a></p>
          <p class="subtitle">2026-03-15 Sun 17:33</p>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1d85a51">1. Intro</a></li>
<li><a href="#orgdd804ae">2. From Duck Creek to Ross County</a></li>
<li><a href="#orge50117e">3. The Farm</a></li>
<li><a href="#org38bf1dd">4. Stories from Youth</a></li>
<li><a href="#org7f7a359">5. Of Jules Vern, Crokinole, and Pinochle</a></li>
<li><a href="#org88c1151">6. Marriage</a></li>
<li><a href="#org12a2701">7. Farming with horses and the 1939 John Deere Model B</a></li>
<li><a href="#org99b3fce">8. Passing the Torch</a></li>
<li><a href="#org9d10377">9. Martha and Mary</a></li>
<li><a href="#orgfd28557">10. Jacking up the old barn</a></li>
<li><a href="#orga53b4b5">11. Bringing in the Sheaves</a></li>
<li><a href="#org8e9a703">12. Later Years</a></li>
<li><a href="#org49b6788">13. About this narrative</a></li>
<li><a href="#org2f80c2c">14. Credits</a></li>
<li><a href="#org6d0d573">15. Feedback requested</a></li>
<li><a href="#orgd4c609c">16. APPENDIX: TIMELINE</a></li>
<li><a href="#org5aa2460">17. APPENDIX: Keeping the names straight (who begat who&#x2026;)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1d85a51" class="outline-2">
<h2 id="org1d85a51"><span class="section-number-2">1.</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
George Leonard Morrison was born in 1885 and died in 1974. His life spanned the age of
horse and buggy to the moon landing.
</p>

<p>
George was born just as the American West was closing. As a young
man, he went west to work as a cook, following the wheat harvest
north across the Great Plains, traveled as far away as Idaho with a
cousin, worked (possibly in the mines) in Hibbing, Minnesota where
his brother Fred lived, and was scammed in a land deal in Roswell,
NM. He sang in a barber shop quartet.
</p>

<p>
During his life, George saw the invention of the automobile, the
airplane, the telephone, movies, records, radio, TV, the atomic
bomb, and rockets that took men to the moon and back.  As someone
raised with the 19th century idea of "progress" I'm sure it was all
amazing, but not totally unexpected.
</p>

<p>
On the world-events front, he saw WW I, the rise of communism in
Russia and China, the Depression, WW II, the effective end of the
British empire, and wars in Korea and Vietnam.
</p>
</div>
</div>
<div id="outline-container-orgdd804ae" class="outline-2">
<h2 id="orgdd804ae"><span class="section-number-2">2.</span> From Duck Creek to Ross County</h2>
<div class="outline-text-2" id="text-2">
<p>
George's father, Elisha Ford Morrison, was veteran of the Union
army. I still have some of his Grand Army of the Republic (GAR)
reunion memorabilia and medals. Mike has his rifle. It was picked up
on the battlefield after his original rifle stopped a bullet that
would likely have killed him (and this narrative). He was at the
battle of Vicksburg. We have copies of his diary from the war. He
married Lydia Catharine (Kate) Gould in 1868.
</p>

<p>
The Morrison family moved from Lower Salem/Duck Creek, Ohio (14 miles
north of Marietta/the Ohio River) to Ross County just after the
Civil War, 1866 I think. George was the baby of the family of 6
children. The Morrisons initially lived near the Bowdles (my 2nd
cousins), on what is now called The Morrison Road. The Bowdle farm was in the
same family 1800-~2010.
</p>

<p>
 Ties to "Duck Creek" remained strong for several generations. There
were trips to reunions and family events (Goulds) in Duck Creek/Lower
Salem. George's cousin Charlie Gould, a geologist who discovered much
of the oil in the Southwest, visited his Ross County relatives a time
or two. George and his brother Ernie thought he was stuck up. Charlie
Gould's autobiography <i>Covered Wagon Geologist</i> describes the "post-frontier"
life in the community.
</p>

<p>
 The community is even mentioned several times in David McCollugh's
book The Pioneers, which documents the founding of the northwest Territory
at Marietta. My five-great grandfather Amos Porter was one
of the early settlers. I still have many family artifacts (family
Bibles, records, furniture, etc.) from Duck Creek. Even in my Youth,
we went to Duck Creek to see the graves at "Mount Ephriam"/"Gould's
Church" and the family barn that was used to hide runaway slaves 14
miles north of the Ohio river. My great-grandmother wrote an extant
letter to the Columbus Dispatch detailing those activities.
</p>
</div>
</div>
<div id="outline-container-orge50117e" class="outline-2">
<h2 id="orge50117e"><span class="section-number-2">3.</span> The Farm</h2>
<div class="outline-text-2" id="text-3">
<p>
My great-grandfather Elisha Morrison bought the farm over the hill
from the Bowdles in 1872. George and the last 4 of his 5 siblings were
born there, as were Mom and Philip. Our family lived on that farm for
almost 100 years. I think the house was originally a small with one story
and was enlarged. I have the receipts (1880s?) for the windows that
were installed when they expanded. I remember Dad washing the outside
of the 2nd story windows on a ladder when George was too old to do
it (and, most likely, when Grandma could not stand to have them dirty).
</p>
</div>
</div>
<div id="outline-container-org38bf1dd" class="outline-2">
<h2 id="org38bf1dd"><span class="section-number-2">4.</span> Stories from Youth</h2>
<div class="outline-text-2" id="text-4">
<p>
The original Bowdle cabin was near where the Bowdle/Morrison cemetery
is today (Union Township, Ross County, Ohio). George told of having
seen the cabin in his youth, with slits still
there for shooting out of (Indians&#x2026;).
</p>

<p>
As a boy, George attended the one-room school house (the Bowdle School)
where his sister Myrtie<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> Morrison (Bowdle) was his teacher. They
used McGuffey readers and other books, some of which I still have.
In those days, you learned all 88 Ohio counties, their county seats,
their chief agricultural output, etc. One day, the story goes, George thought
he didn't have to mind the teacher because she was his sister, so he
bit her.
</p>

<p>
In the early 20th century, neighbor Jake Lapp owned a threshing machine (before
combines).  He went around to different farms in turn threshing their
wheat. (Threshing is beating the wheat to remove the stalks and husks and make the seeds fall out.)  I think it was a community event; everyone took turns helping
on each other's farms.   And the women cooked up a storm for the hungry
boys.  Pretty sure I saw echos of that in the way Grandma and Aunt
Bess cooked.
</p>

<p>
There was apparently an Indian village on the site of the Morrison
farm at some point, in the area down by the creek (Beirs Run) where it
crossed the Allbright-Mill Road.   When plowing was done with horses,
they would often see flint arrow-heads, stone axes etc.  They
collected a box full of 
</p>
</div>
</div>
