1974=morrison=george__biography.html
<div id="outline-container-org7f7a359" class="outline-2">
<h2 id="org7f7a359"><span class="section-number-2">5.</span> Of Jules Vern, Crokinole, and Pinochle</h2>
<div class="outline-text-2" id="text-5">
<p>
As a young man,  George liked the
science fiction of the then-not-so-old Jules Verne, with stories of
air travel (written before the Wright Brothers flight), and From the
Earth to the Moon and Back Again which featured a launch from Florida.
JFK was not the first person with that idea. I'm told by Nancy Bowdle
(Bozak) that she also used to go over and borrow Zane Grey novels which she
liked reading. Per Philip George said "the real difference in the stories
was that ‘in one, the bad guy was shot in the front, and in another
in the back.’"
</p>

<p>
And as with Verne's Philleas Fogg and Whist, it seems games have
long been a thing in our family.  Some years back, Philip gave me the
family Crokinole board which, by the looks of it, dates to the 19th
century and is well-used.  Philip
tells me that "Uncle Billy and Cousin Clarence 'Fordie' Morrison" would
often come over to play Pinochle" (perhaps when they lived over the
hill on the place on the Morrison road?).  I have Grandma's (Esther Morrison)
dominoes, which I know from personal experience had good use.  The newly-wed Bob and Lois
Jones (Morrison) reportedly played a lot of Canasta their first winter
in St. Johns, Newfound, continuing the tradition with Rook and other
games on rainy days in the camper.  There were innumerable games of
Risk in my youth.  So, young'ns, don't think you've started any thing
new with Rail Baron, Civ, Catan, Gravwell, Wingspan, or whatever comes
next.  It seems our family as LONG enjoyed each other’s company over
games.
</p>
</div>
</div>
<div id="outline-container-org88c1151" class="outline-2">
<h2 id="org88c1151"><span class="section-number-2">6.</span> Marriage</h2>
<div class="outline-text-2" id="text-6">
<p>
I don't know a lot between George's adventures as a youth and marriage
to Grandma in 1929 (age 43). Grandma had been working for the Morrisons,
helping with domestic chores/care as my great-grandmother moved into
her 80s. Grandma was born in 1910. At the time of her marriage, she was a college freshman
at Wilmington college, studying to be a teacher. George drove there,
picked her up, and married her over the river in Maysville, KY
(I think, due to lower age of consent). The stock market crash happened
two weeks later, starting the Great Depression.
</p>

<p>
Philip was born in 1933 and Mom in 1936.
</p>
</div>
</div>
<div id="outline-container-org12a2701" class="outline-2">
<h2 id="org12a2701"><span class="section-number-2">7.</span> Farming with horses and the 1939 John Deere Model B</h2>
<div class="outline-text-2" id="text-7">
<p>
Farming with draft horses is hard work in your 50s and 60s or if you
are a 7-year-old boy.  My great-grandmother died in 1939, and after that, they
bought a 1939 John Deere Model B tractor.  I'm guessing they came into
a little money when she passed.  She had a survivor’s pension from her
husband's service in the Union army (wonder if families in the South
were so lucky? &#x2026;.)
</p>

<p>
And, for perspective, Philip remembers to this day (2023-02-20) when
they were still plowing with the last of the draft horses.  The world
has changed.   But not that long ago.
</p>
</div>
</div>
<div id="outline-container-org99b3fce" class="outline-2">
<h2 id="org99b3fce"><span class="section-number-2">8.</span> Passing the Torch</h2>
<div class="outline-text-2" id="text-8">
<p>
In her last years, my great grandmother Kate Morrison had dementia. Mom, then 3, remembered brushing
her long hair. Philip remembers saying "Grandma wants to go back to
Duck Creek again.”  I think at some point we all just want to go "home".
</p>

<p>
Uncle Ernie died ~1953. His will left his 1/2 of
the farm to George "for his lifetime" and then to Mom and Philip.
When the farm was sold around 1968, Mom and Philip had to sign off.
</p>
</div>
</div>
<div id="outline-container-org9d10377" class="outline-2">
<h2 id="org9d10377"><span class="section-number-2">9.</span> Martha and Mary</h2>
<div class="outline-text-2" id="text-9">
<p>
Grandma was a driven, hard-working perfectionist who could not stand a
hair out of place and expected the same of those around her.   This
contrasted with George's more easy-going personality and was a source
of tension.  The story goes that on a fall day, George could look out
across the yard and fields and see the beautiful colors on the trees,
while Grandma could only see the picket fence that needed repair.
</p>

<p>
Philip recalls an aspect of that:
</p>

<p>
'I do remember several sayings from Daddy. When
Mom was on the warpath, he would tell me that'
</p>

<blockquote>
<p>
"A scolding doesn't hurt
and a whipping doesn't last long."
</p>
</blockquote>

<p>
'along with several other quotes. When he wanted me to do something for him and I
wanted to play with some of my local friends, he would say'
</p>

<blockquote>
<p>
"One boy, whole boy;
two boys, half boy;
and three boys, no boy at all.”
</p>
</blockquote>

<p>
'When he taught me to drive, he told me to'
</p>

<blockquote>
<p>
"Always drive like you think the other guy is drunk or crazy.”
</p>
</blockquote>

<p>
'All of which was good advice. The older I get (and I am now slightly older than he was when he died) the more I miss him and realize how blessed I was to have him as a father.'
</p>
</div>
</div>
<div id="outline-container-orgfd28557" class="outline-2">
<h2 id="orgfd28557"><span class="section-number-2">10.</span> Jacking up the old barn</h2>
<div class="outline-text-2" id="text-10">
<p>
When George was in his late 70s, the barn needed a new foundation.
He decided to jack it up and pour a new one. Dad told him he couldn't
do it. He did. And the initials of all 4 (then) of the grand-kids (me
included) were written in the foundation.   Sadly, the barn burned
some years after they sold the farm.
</p>
</div>
</div>
<div id="outline-container-orga53b4b5" class="outline-2">
<h2 id="orga53b4b5"><span class="section-number-2">11.</span> Bringing in the Sheaves</h2>
<div class="outline-text-2" id="text-11">
<p>
When you're pushing 80, it's hard to bring the hay bales in from the
field and put them in the hay mow.  Fortunately, about that time,
there were a passel of Bowdle Boy (my 2nd cousins ) in their teens and
20s who came over and did the job.  George drove
the tractor.   Mike and I rode on top of the hay bales on the wagon
and later threw some down, getting into big trouble.
</p>

<p>
But it got to the point that George could no longer jack up barns, drive
Tractors, or fix the broken fences that annoyed Grandma, so they sold
the farm and moved to Worthington to be near us/Mom.  There was a big
sale with 100 years of stuff on tables outside and lots of strangers
buying things.  I remember being there as a young child thinking how odd it was. The tractor was sold.
</p>
</div>
</div>
<div id="outline-container-org8e9a703" class="outline-2">
<h2 id="org8e9a703"><span class="section-number-2">12.</span> Later Years</h2>
<div class="outline-text-2" id="text-12">
<p>
My clearest memories of George are, unfortunately, from his declining
years. Laurence Welk was a thing. Newspapers were a thing. We watched
the last out of the '72 world series together on TV (in part sparking
me to 45 years of following the Reds). He had lots of odd little words
and sayings. Your "pie hole" (mouth). "Bubbles" (Kix cereal). "Slip-downs"
(noodles). "Fiddle-sticks.” "Oh, Pshaw.”
</p>

<p>
In his final years, his Parkinson's disease advanced and his hands shook
all the time. Mom and Grandma later had his armchair re-upholstered because
he had worn it bare. He had to use a walker. Mom and Grandma cared
for him at home his final days. Today, in such situations, we usually
involve professional help, but their model was caring for your own.
They were both burned out at the end.  His last meal was stewed
rhubarb.
</p>

<p>
The moon landing happened a few years after they moved, with Neal Armstrong,
from one those memorized Ohio counties, walking on the moon 66 years
after two brothers from another Ohio county had made the first powered
flight. The world had changed. Anything seemed possible. The day he
died, Mark and I were on the couch designing model rockets.
</p>

<p>
What a time to have been alive!
</p>
</div>
</div>
