1974=morrison=george__biography.org
* About this narrative
 This was written almost entirely from memory. Very little attempt
has been made to check dates, names, etc. The goal was to capture experiences,
memories, and oral history, as I have been told family stories, some
of which go back to the 1800s. I used what I know of financial circumstances
as loose writing prompts and to structure the narrative.

* Credits
  - Philip Morrison :: Initial reading, added stories, fact checking.
  - John Bowdle :: Genealogy
  - Trish Jones :: Proof Reading, Professional Editing
  - Lois Morrison Jones, Esther Morrison :: For telling me most of
    what's in this narrative.
* Feedback requested
  Please give me feedback on:

  - More stories, oral tradition, personal memories (stuff in your head)
    + The focus is NOT genealogy, dates, fact-checking per-se
  - What was most interesting?
  - What was boring or confusing?
  - What would you like to know more about?
  - What could be left out?

* APPENDIX: TIMELINE
  |  WHEN | WHAT                       | TYPE       | WHERE             | WHO                                     |
  |-------+----------------------------+------------+-------------------+-----------------------------------------|
  |  1885 | Born                       | Life Event |                   | Mr & Mrs. E.F. Morrison                 |
  |  1906 | Father Dies                | Life Event |                   | E.F. Morrison                           |
  |  1929 | Married                    | Life Event | Maysville, KY     | Esther Josephine Free                   |
  |  1933 | Son Born                   | Life Event | Farm, Ross Co. OH | Philip Lee Morrison                     |
  |  1936 | Daughter Born              | Life Event | Farm, Ross Co. OH | Lois Elaine Morrison (Jones)            |
  |  1939 | Mother Dies                | Life Event |                   | Lydia Catharine (Kate) Gould (Morrison) |
  | ?1939 | Bought Tractor             | Financial  |                   |                                         |
  | ?1967 | Move to Worthington        | Move       | Worthington, Ohio |                                         |
  |  1968 | Sold Farm                  | Financial  |                   |                                         |
  |  1974 | Died, Old Age + Parkensons | Life Event | Worthington, Ohio |                                         |

* APPENDIX: Keeping the names straight (who begat who...) 

Genealogy is an anti-goal of this writing effort, but there 
are enough names that it might get confusing without
a little context.  Contact the author if you are interested
in more detail.

# This export has to be duplicated in both latex and html
# I've tried a number of ways to do this with a single
# export, but XeLaTeX which is required seems not to be
# working.  See [[denote:20260316T113820][Keeping Unicode Characters in export]]

#+begin_export latex
\begin{verbatim}
Amos Porter
└─Simon Porter
  └─Lois Porter
    │
    m. Ephriam Gould
    │
    └─Lydia C. Gould
      │
      m. Elisha F. Morrison
      │
      ├─Myrtie
          └─ Grandmother of John Bowdle, etc.
      ├─Fred
      ├─Ernie
      ├─...
      └─GEORGE L. MORRISON (1885-1974)
        │
        m. Esther J. Free
        │
        ├─Philip Lee Morrison
        │
        └─Lois Elaine Morrison
          │
          m. Bob Jones
          │
          ├─...
          └─George M. Jones (author)
\end{verbatim}
#+end_export
#+begin_export html
<pre>
Amos Porter
└─Simon Porter
  └─Lois Porter
    │
    m. Ephriam Gould
    │
    └─Lydia C. Gould
      │
      m. Elisha F. Morrison
      │
      ├─Myrtie
          └─ Grandmother of John Bowdle, etc.
      ├─Fred
      ├─Ernie
      ├─...
      └─GEORGE L. MORRISON (1885-1974)
        │
        m. Esther J. Free
        │
        ├─Philip Lee Morrison
        │
        └─Lois Elaine Morrison
          │
          m. Bob Jones
          │
          ├─...
          └─George M. Jones (author)
</pre>
#+end_export

* Footnotes

[fn:1] In our branch of the family my grandfather's sister was always referred to as "Myrtie".   Her name was Myrta (I have several of her books, etc that she signed).   She was the grandmother of the John Bowdle, etc, hence John Bowdle who has provided me with much genealogical info is my 2nd cousin. 
