1974=morrison=george__biography.html
<div id="outline-container-org49b6788" class="outline-2">
<h2 id="org49b6788"><span class="section-number-2">13.</span> About this narrative</h2>
<div class="outline-text-2" id="text-13">
<p>
 This was written almost entirely from memory. Very little attempt
has been made to check dates, names, etc. The goal was to capture experiences,
memories, and oral history, as I have been told family stories, some
of which go back to the 1800s. I used what I know of financial circumstances
as loose writing prompts and to structure the narrative.
</p>
</div>
</div>
<div id="outline-container-org2f80c2c" class="outline-2">
<h2 id="org2f80c2c"><span class="section-number-2">14.</span> Credits</h2>
<div class="outline-text-2" id="text-14">
<dl class="org-dl">
<dt>Philip Morrison</dt><dd>Initial reading, added stories, fact checking.</dd>
<dt>John Bowdle</dt><dd>Genealogy</dd>
<dt>Trish Jones</dt><dd>Proof Reading, Professional Editing</dd>
<dt>Lois Morrison Jones, Esther Morrison</dt><dd>For telling me most of
what's in this narrative.</dd>
</dl>
</div>
</div>
<div id="outline-container-org6d0d573" class="outline-2">
<h2 id="org6d0d573"><span class="section-number-2">15.</span> Feedback requested</h2>
<div class="outline-text-2" id="text-15">
<p>
Please give me feedback on:
</p>

<ul class="org-ul">
<li>More stories, oral tradition, personal memories (stuff in your head)
<ul class="org-ul">
<li>The focus is NOT genealogy, dates, fact-checking per-se</li>
</ul></li>
<li>What was most interesting?</li>
<li>What was boring or confusing?</li>
<li>What would you like to know more about?</li>
<li>What could be left out?</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4c609c" class="outline-2">
<h2 id="orgd4c609c"><span class="section-number-2">16.</span> APPENDIX: TIMELINE</h2>
<div class="outline-text-2" id="text-16">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">WHEN</th>
<th scope="col" class="org-left">WHAT</th>
<th scope="col" class="org-left">TYPE</th>
<th scope="col" class="org-left">WHERE</th>
<th scope="col" class="org-left">WHO</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1885</td>
<td class="org-left">Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Mr &amp; Mrs. E.F. Morrison</td>
</tr>

<tr>
<td class="org-right">1906</td>
<td class="org-left">Father Dies</td>
<td class="org-left">Life Event</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">E.F. Morrison</td>
</tr>

<tr>
<td class="org-right">1929</td>
<td class="org-left">Married</td>
<td class="org-left">Life Event</td>
<td class="org-left">Maysville, KY</td>
<td class="org-left">Esther Josephine Free</td>
</tr>

<tr>
<td class="org-right">1933</td>
<td class="org-left">Son Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">Farm, Ross Co. OH</td>
<td class="org-left">Philip Lee Morrison</td>
</tr>

<tr>
<td class="org-right">1936</td>
<td class="org-left">Daughter Born</td>
<td class="org-left">Life Event</td>
<td class="org-left">Farm, Ross Co. OH</td>
<td class="org-left">Lois Elaine Morrison (Jones)</td>
</tr>

<tr>
<td class="org-right">1939</td>
<td class="org-left">Mother Dies</td>
<td class="org-left">Life Event</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Lydia Catharine (Kate) Gould (Morrison)</td>
</tr>

<tr>
<td class="org-right">?1939</td>
<td class="org-left">Bought Tractor</td>
<td class="org-left">Financial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">?1967</td>
<td class="org-left">Move to Worthington</td>
<td class="org-left">Move</td>
<td class="org-left">Worthington, Ohio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1968</td>
<td class="org-left">Sold Farm</td>
<td class="org-left">Financial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1974</td>
<td class="org-left">Died, Old Age + Parkensons</td>
<td class="org-left">Life Event</td>
<td class="org-left">Worthington, Ohio</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5aa2460" class="outline-2">
<h2 id="org5aa2460"><span class="section-number-2">17.</span> APPENDIX: Keeping the names straight (who begat who&#x2026;)</h2>
<div class="outline-text-2" id="text-17">
<p>
Genealogy is an anti-goal of this writing effort, but there 
are enough names that it might get confusing without
a little context.  Contact the author if you are interested
in more detail.
</p>

<pre>
Amos Porter
└─Simon Porter
  └─Lois Porter
    │
    m. Ephriam Gould
    │
    └─Lydia C. Gould
      │
      m. Elisha F. Morrison
      │
      ├─Myrtie
          └─ Grandmother of John Bowdle, etc.
      ├─Fred
      ├─Ernie
      ├─...
      └─GEORGE L. MORRISON (1885-1974)
        │
        m. Esther J. Free
        │
        ├─Philip Lee Morrison
        │
        └─Lois Elaine Morrison
          │
          m. Bob Jones
          │
          ├─...
          └─George M. Jones (author)
</pre>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
In our branch of the family my grandfather's sister was always referred to as "Myrtie".   Her name was Myrta (I have several of her books, etc that she signed).   She was the grandmother of the John Bowdle, etc, hence John Bowdle who has provided me with much genealogical info is my 2nd cousin. 
</p></div></div>


</div>
</div></div>
</body>
</html>
